In [1]:
import numpy as n

In [2]:
import pandas as pd

In [ ]:
Label = ['a', 'b', 'c']
my_data = [10, 20,30]
arr = n.array(my_data)
d = {'a':10, 'b': 20, 'c':30}

In [ ]:
d

{'a': 10, 'b': 20, 'c': 30}

In [ ]:
pd.Series(data=my_data, index=d)

a    10
b    20
c    30
dtype: int64

You don't need to add data and index if you passes in order.

In [ ]:
pd.Series(my_data, Label)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [ ]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [ ]:
ser1 = pd.Series([1,2,3,4],['USA', 'Germany', 'URSS', 'Japan'])

In [ ]:
ser1

USA        1
Germany    2
URSS       3
Japan      4
dtype: int64

In [ ]:
ser2 = pd.Series([1,2,5,4],['USA', 'Germany', 'Italy', 'Japan'])

In [ ]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [ ]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
URSS       NaN
USA        2.0
dtype: float64

# DATAFRAMES

In [3]:
from numpy.random import randn

In [4]:
n.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4),['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [6]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [ ]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [ ]:
df['NEW'] = df['W'] + df['Y']

In [ ]:
df

          W         X         Y         Z       NEW
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [ ]:
df.drop('NEW', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.drop('NEW', axis=1, inplace=True)

In [ ]:
df.shape

(5, 4)

Select Rows

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [ ]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [ ]:
df.loc['B', 'Y']

-0.8480769834036315

In [ ]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [7]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [8]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [9]:
booldf = df > 0

In [10]:
booldf

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [11]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [12]:
df['X']>0

A     True
B    False
C     True
D    False
E     True
Name: X, dtype: bool

In [13]:
df[df['X']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
E  0.190794  1.978757  2.605967  0.683509

In [14]:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [16]:
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [18]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [20]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [23]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [24]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2',]
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_inside = pd.MultiIndex.from_tuples(hier_index)

In [25]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [27]:
df = pd.DataFrame(randn(6,2))
df

          0         1
0 -0.497104 -0.754070
1 -0.943406  0.484752
2 -0.116773  1.901755
3  0.238127  1.996652
4 -0.993263  0.196800
5 -1.136645  0.000366

Multilevel of Index

In [61]:
dc = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])
dc

                A         B
(G1, 1)  0.641806 -0.905100
(G1, 2) -0.391157  1.028293
(G1, 3) -1.972605 -0.866885
(G2, 1)  0.720788 -1.223082
(G2, 2)  1.606780 -1.115710
(G2, 3) -1.385379 -1.329660

In [65]:
dc[['A','B']]

                A         B
(G1, 1)  0.641806 -0.905100
(G1, 2) -0.391157  1.028293
(G1, 3) -1.972605 -0.866885
(G2, 1)  0.720788 -1.223082
(G2, 2)  1.606780 -1.115710
(G2, 3) -1.385379 -1.329660

In [67]:
dc.index.names = ['Group']

In [68]:
dc

                A         B
Group
(G1, 1)  0.641806 -0.905100
(G1, 2) -0.391157  1.028293
(G1, 3) -1.972605 -0.866885
(G2, 1)  0.720788 -1.223082
(G2, 2)  1.606780 -1.115710
(G2, 3) -1.385379 -1.329660

Missing Data

In [69]:
d = { 'A': [1,2, n.nan], 'B': [5, n.nan, n.nan], 'C':[1,2,3]}

In [70]:
df = pd.DataFrame(d)

In [71]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [72]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [73]:
df.fillna(value="Null")

      A     B  C
0   1.0   5.0  1
1   2.0  Null  2
2  Null  Null  3

In [74]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [75]:
data = {'Company': ['GOOD', 'GOOD', 'MSFT', 'MSFT', 'FB', 'FB'],
'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
'Sales': [200,120,340,124,243,350]}

In [76]:
df = pd.DataFrame(data)

In [77]:
df

  Company   Person  Sales
0    GOOD      Sam    200
1    GOOD  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [78]:
byComp = df.groupby('Company')

In [79]:
byComp.mean()

C:\Users\rober\AppData\Local\Temp\ipykernel_14500\1270089407.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.mean()

         Sales
Company
FB       296.5
GOOD     160.0
MSFT     232.0

In [80]:
byComp.sum()

C:\Users\rober\AppData\Local\Temp\ipykernel_14500\310972714.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.sum()

         Sales
Company
FB         593
GOOD       320
MSFT       464

In [81]:
byComp.std()

C:\Users\rober\AppData\Local\Temp\ipykernel_14500\3568384627.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  byComp.std()

              Sales
Company
FB        75.660426
GOOD      56.568542
MSFT     152.735065

In [82]:
df.groupby('Company').sum().loc['FB']

C:\Users\rober\AppData\Local\Temp\ipykernel_14500\3563751855.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [83]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOD      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [84]:
df.groupby('Company').describe().transpose()

Company              FB        GOOD        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [5]:
df= pd.DataFrame({'col1': [1,2,3,4],'col2': [444,555,666,444],'col3': ['abc', 'def', 'ghi', 'xyz']})

In [6]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [7]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [9]:
len(df['col2'].unique())

3

In [95]:
df['col2'].nunique()

3

In [96]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

Pass Functions to a selected dataframe

In [97]:
def time2(x):
    return x*2

In [98]:
df['col1'].apply(time2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [99]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [10]:
df['col2'].apply(lambda x: x * 3)

0    1332
1    1665
2    1998
3    1332
Name: col2, dtype: int64

In [11]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi